RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/source/cyhal_adc_mic.c
/***************************************************************************/ /**
* \file cyhal_adc_mic.c
*
* \brief
* Provides a high level interface for interacting with the Infineon Analog/Digital
* convert. This interface abstracts out the chip specific details. If any chip
* specific functionality is necessary, or performance is critical the low level
* functions can be used directly.
*
********************************************************************************
* \copyright
* Copyright 2018-2021 Cypress Semiconductor Corporation (an Infineon company) or
* an affiliate of Cypress Semiconductor Corporation
*
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

/**
 * \addtogroup group_hal_impl_adcmic ADC (Analog Digital Converter)
 * \ingroup group_hal_impl
 * \{
 * \section cyhal_adcmic_impl_features Features
 * The CAT1B ADC supports the following features:
 * * Resolution: 16 bit
 * * Sample rate: Fixed 480 ksps
 * * Minimum acquisition time: Up to 2084 ns
 * * SW-based async transfer only (DMA is not supported)
 * * VREF: @ref CYHAL_ADC_REF_INTERNAL (1.8V) only
 * * Only @ref CYHAL_POWER_LEVEL_DEFAULT and @ref CYHAL_POWER_LEVEL_OFF are defined.
 * * Single ended vneg: @ref CYHAL_ADC_VNEG_VSSA
 *
 * The following functions are not supported:
 * * Differential channels
 * * Continuous scanning
 * * @ref CYHAL_ADC_EOS event (this is only applicable when continuously scanning)
 * * Averaging. In @ref cyhal_adc_config_t, average count must be 1 and average_mode_flags must be 0.
 *   In @ref cyhal_adc_channel_config_t, enable_averaging must be false.
 * * External vref and bypass pins
 * *
 * \} group_hal_impl_adcmic
 */

#include "cyhal_adc.h"
#include "cyhal_clock.h"
#include "cyhal_gpio.h"
#include "cyhal_hwmgr.h"
#include "cyhal_utils.h"
#include "cyhal_irq_psoc.h"
#include "cyhal_system.h"
#include <string.h>

#if (_CYHAL_DRIVER_AVAILABLE_ADC_MIC)
#include "cy_adcmic.h"

#if defined(__cplusplus)
extern "C"
{
#endif

#define _CYHAL_ADCMIC_NUM_CHANNELS(obj) (sizeof(obj->channel_config) / sizeof(obj->channel_config[0]))
static const uint8_t  _CYHAL_ADCMIC_RESOLUTION          = 16u;
static const uint32_t _CYHAL_ADCMIC_TARGET_CLOCK_HZ     = 24000000u;
static const uint32_t _CYHAL_ADCMIC_SAMPLE_RATE_HZ      = 480000u; /* Fixed by the HW */
static const uint32_t _CYHAL_ADCMIC_ACQUISITION_TIME_NS = 2084u;   /* 1 / 480 ksps */

static const cy_stc_adcmic_dc_path_config_t _CYHAL_ADCMIC_DEFAULT_DC_CONFIG =
{
    .range = CY_ADCMIC_DC_RANGE_3_6V,
    .input = CY_ADCMIC_REFGND, /* Will be updated to match the actual input when a read is triggered */
    .tmrLatch = true,
};

static const cy_stc_adcmic_timer_trigger_config_t _CYHAL_ADCMIC_TMR_TRG_CFG =
{
    .timerTrigger = true,
    .fifoTrigger = false,
    .period = 10000,
    .input = CY_ADCMIC_TIMER_COUNT_INPUT_CLK_SYS
};

static const cy_stc_adcmic_config_t _CYHAL_ADCMIC_DEFAULT_CONFIG =
{
    .clockDiv = 1U,
    .source = CY_ADCMIC_DC,
    .sampleRate = CY_ADCMIC_480KSPS, /* This is the only sample rate supported for DC measurement */
    .anaConfig = NULL, /* Only applicable for the analog mic input path */
    .digConfig = NULL, /* Only applicable for the digital PDM input path */
    /* Safe to cast away const because this struct is itself stored in flash */
    .dcConfig = (cy_stc_adcmic_dc_path_config_t *)&_CYHAL_ADCMIC_DEFAULT_DC_CONFIG,
    .biQuadConfig = NULL, /* BiQuad isn't used for DC measurements */
    .fifoConfig = NULL, /* FIFO isn't used for DC measurements */
    .tmrTrgConfig = &_CYHAL_ADCMIC_TMR_TRG_CFG,
};

static MXS40ADCMIC_Type *const _cyhal_adcmic_base[] =
{
#if (CY_IP_MXS40ADCMIC_INSTANCES <= 1)
    MXS40ADCMIC0,
#else
    #warning "Unhandled ADCMIC instance count"
#endif
};

static const en_clk_dst_t _cyhal_adcmic_clock[] =
{
#if (CY_IP_MXS40ADCMIC_INSTANCES <= 1)
    PCLK_ADCMIC_CLK_HF,
#else
    #warning "Unhandled ADCMIC instance count"
#endif
};

static cyhal_adc_t* _cyhal_adcmic_config_structs[CY_IP_MXS40ADCMIC_INSTANCES];

static const _cyhal_system_irq_t _cyhal_adcmic_irq_n[] =
{
#if (CY_IP_MXS40ADCMIC_INSTANCES <= 1)
    adcmic_interrupt_adcmic_IRQn,
#else
    #warning "Unhandled ADCMIC instance count"
#endif
};

static uint8_t _cyhal_adcmic_get_block_from_irqn(_cyhal_system_irq_t irqn)
{
    switch (irqn)
    {
    #if (CY_IP_MXS40ADCMIC_INSTANCES <= 1)
        case adcmic_interrupt_adcmic_IRQn:
            return 0;
    #else
        #warning "Unhandled ADCMIC instance count"
    #endif
        default:
            CY_ASSERT(false); // Should never be called with a non-ADCMIC IRQn
            return 0;
    }
}

/* Find the next enabled channel, starting from current_idx and adjusting the buffer
 * along the way to account for disabled channels */
static void _cyhal_adcmic_find_next_channel(cyhal_adc_t* obj, uint8_t* current_idx, int32_t **buffer)
{
    uint8_t start_idx = *current_idx;
    do
    {
        if(NULL != obj->channel_config[*current_idx])
        {
            if(obj->channel_config[*current_idx]->enabled)
            {
                break;
            }
            else
            {
                ++(*buffer);
            }
            *current_idx = (*current_idx + 1) % _CYHAL_ADCMIC_NUM_CHANNELS(obj);
        }
    } while(*current_idx != start_idx); /* While we haven't wrapped completely around */
}

static uint16_t _cyhal_adc_cnt_to_u16(int16_t raw_cnt)
{
    uint16_t raw_cnt_fixed = (uint16_t)(raw_cnt - CY_ADCMIC_DC_OFFSET);
    // Scaling 0 - CY_ADCMIC_DC_FS_CNT range to 0 - CY_ADCMIC_DC_FS (0xFFFF) range
    // CY_ADCMIC_DC_FS_CNT is multiplied by 10, so division needed
    uint16_t scaled_cnt = (uint16_t)(raw_cnt_fixed * CY_ADCMIC_DC_FS / (CY_ADCMIC_DC_FS_CNT / 10U));
    return scaled_cnt;
}

