RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/source/cyhal_adc_mic.c
static void _cyhal_adcmic_irq_handler(void)
{
    /* The only interrupt we enable is DC conversion complete */
    _cyhal_system_irq_t irqn = _cyhal_irq_get_active();
    uint8_t block = _cyhal_adcmic_get_block_from_irqn(irqn);
    cyhal_adc_t* obj = _cyhal_adcmic_config_structs[block];
    Cy_ADCMic_ClearInterrupt(obj->base, CY_ADCMIC_INTR_DC);
    obj->conversion_complete = true;

    if(obj->async_scans_remaining > 0)
    {
        int16_t dc_data = Cy_ADCMic_GetDcResult(obj->base);
        if (obj->async_transfer_in_uv)
        {
            *(obj->async_buff_next) = Cy_ADCMic_CountsTo_uVolts(obj->base, dc_data);
        }
        else
        {
            *(obj->async_buff_next) = (int32_t)_cyhal_adc_cnt_to_u16(dc_data);
        }
        obj->async_buff_next++;
        uint8_t old_channel = obj->current_channel_index;
        _cyhal_adcmic_find_next_channel(obj, &(obj->current_channel_index), &(obj->async_buff_next));
        /* we know that at least one channel was enabled, so we don't have to worry about that case,
         * but we do need to check for rollover */
        if(obj->current_channel_index <= old_channel)
        {
            --(obj->async_scans_remaining);
            if(obj->async_scans_remaining == 0)
            {
                /* We're done, notify the user if they asked us to */
                obj->async_buff_next = NULL;
                Cy_ADCMic_DisableInterrupt(obj->base, CY_ADCMIC_INTR_DC);
                Cy_ADCMic_DisableTimer(obj->base);
                if(0 != (CYHAL_ADC_ASYNC_READ_COMPLETE & ((cyhal_adc_event_t)obj->user_enabled_events)))
                {
                    cyhal_adc_event_callback_t callback = (cyhal_adc_event_callback_t)obj->callback_data.callback;
                    if(NULL != callback)
                    {
                        callback(obj->callback_data.callback_arg, CYHAL_ADC_ASYNC_READ_COMPLETE);
                    }
                }
            }
        }
    }
    else
    {
        Cy_ADCMic_DisableTimer(obj->base);
    }
}

static cy_en_adcmic_dc_channel_t _cyhal_adcmic_convert_channel_sel(uint8_t bit_index)
{
    static const cy_en_adcmic_dc_channel_t gpio_channel[] =
    {
        CY_ADCMIC_GPIO0,
        CY_ADCMIC_GPIO1,
        CY_ADCMIC_GPIO2,
        CY_ADCMIC_GPIO3,
        CY_ADCMIC_GPIO4,
        CY_ADCMIC_GPIO5,
        CY_ADCMIC_GPIO6,
        CY_ADCMIC_GPIO7,
        CY_ADCMIC_GPIO8,
        CY_ADCMIC_GPIO9,
        CY_ADCMIC_GPIO10,
        CY_ADCMIC_GPIO11,
        CY_ADCMIC_GPIO12,
        CY_ADCMIC_GPIO13,
        CY_ADCMIC_GPIO14,
        CY_ADCMIC_GPIO15,
        CY_ADCMIC_GPIO16,
        CY_ADCMIC_GPIO17,
        CY_ADCMIC_GPIO18,
        CY_ADCMIC_GPIO19,
        CY_ADCMIC_GPIO20,
        CY_ADCMIC_GPIO21,
        CY_ADCMIC_GPIO22,
        CY_ADCMIC_GPIO23,
        CY_ADCMIC_GPIO24,
        CY_ADCMIC_GPIO25,
        CY_ADCMIC_GPIO26,
        CY_ADCMIC_GPIO27
    };

    if (bit_index < sizeof(gpio_channel) / sizeof(gpio_channel[0]))
    {
        return gpio_channel[bit_index];
    }
    else
    {
        CY_ASSERT(false); /* We only support GPIO channels and the above defines all of them */
        return CY_ADCMIC_REFGND;
    }
}

/*******************************************************************************
*       ADC HAL Functions
*******************************************************************************/

cy_rslt_t _cyhal_adc_config_hw(cyhal_adc_t *obj, const cyhal_adc_configurator_t* cfg, cyhal_gpio_t pin, bool owned_by_configurator)
{
    CY_ASSERT(NULL != obj);

    cy_rslt_t result = CY_RSLT_SUCCESS;
    memset(obj, 0, sizeof(cyhal_adc_t));
    obj->resource.type = CYHAL_RSC_INVALID;

    obj->owned_by_configurator = owned_by_configurator;

    if(NULL == cfg->resource && NC != pin)
    {
        for (uint32_t i = 0; i < sizeof(cyhal_pin_map_adcmic_gpio_adc_in)/sizeof(cyhal_resource_pin_mapping_t); i++)
        {
            if (pin == cyhal_pin_map_adcmic_gpio_adc_in[i].pin)
            {
                // Force the channel_num to 0 since the ADC_MIC pin_map repurposes that field
                cyhal_resource_inst_t inst = { CYHAL_RSC_ADCMIC, cyhal_pin_map_adcmic_gpio_adc_in[i].block_num, 0 };
                if (CY_RSLT_SUCCESS == cyhal_hwmgr_reserve(&inst))
                {
                    obj->resource = inst;
                    break;
                }
            }
        }

        if (obj->resource.type == CYHAL_RSC_INVALID)
        {
            result = CYHAL_ADC_RSLT_BAD_ARGUMENT;
        }
    }
    else if(NULL != cfg->resource)
    {
        obj->resource = *cfg->resource;
    }
    else
    {
        result = CYHAL_ADC_RSLT_BAD_ARGUMENT;
    }

    en_clk_dst_t pclk = (en_clk_dst_t)0;
    if (CY_RSLT_SUCCESS == result)
    {
        obj->base = _cyhal_adcmic_base[obj->resource.block_num];
        pclk = _cyhal_adcmic_clock[obj->resource.block_num];
        if (NULL != cfg->clock)
        {
            obj->clock = *cfg->clock;
            obj->dedicated_clock = false;
        }
        else if (CY_RSLT_SUCCESS ==
            (result = _cyhal_utils_allocate_clock(&(obj->clock), &(obj->resource), CYHAL_CLOCK_BLOCK_PERIPHERAL_16BIT, true)))
        {
            obj->dedicated_clock = true;
            result = cyhal_clock_set_enabled(&(obj->clock), true /* enabled */, false /* don't wait for lock. Not applicable to dividers */);
        }
    }

    if (CY_RSLT_SUCCESS == result && obj->clock.block != CYHAL_CLOCK_BLOCK_HF)
    {
        if (CY_SYSCLK_SUCCESS != _cyhal_utils_peri_pclk_assign_divider(pclk, &(obj->clock)))
            result = CYHAL_ADC_RSLT_FAILED_CLOCK;
    }

    if (CY_RSLT_SUCCESS == result)
    {
        if(obj->dedicated_clock)
        {
            if(CY_RSLT_SUCCESS != _cyhal_utils_set_clock_frequency(&(obj->clock), _CYHAL_ADCMIC_TARGET_CLOCK_HZ, NULL))
            {
               result = CYHAL_ADC_RSLT_FAILED_CLOCK;
            }
        }
    }

    if (result == CY_RSLT_SUCCESS)
    {
        result = (cy_rslt_t)Cy_ADCMic_Init(obj->base, cfg->config);
    }

    if (result == CY_RSLT_SUCCESS)
    {
        result = (cy_rslt_t)Cy_ADCMic_SetDcConvTime(obj->base, CY_ADCMIC_DC_CONV_TIME_15_US);
    }

    if (result == CY_RSLT_SUCCESS)
    {
        Cy_ADCMic_Enable(obj->base);
        _cyhal_adcmic_config_structs[obj->resource.block_num] = obj;
        cy_stc_sysint_t irqCfg = { _cyhal_adcmic_irq_n[obj->resource.block_num], CYHAL_ISR_PRIORITY_DEFAULT };
        Cy_SysInt_Init(&irqCfg, _cyhal_adcmic_irq_handler);
        NVIC_EnableIRQ(_cyhal_adcmic_irq_n[obj->resource.block_num]);
        Cy_ADCMic_StartConvert(obj->base);
    }
    else
    {
        cyhal_adc_free(obj);
    }
    return result;
}

cy_rslt_t cyhal_adc_init(cyhal_adc_t *obj, cyhal_gpio_t pin, const cyhal_clock_t *clk)
{
    cyhal_adc_configurator_t config;
    config.resource = NULL;
    config.config = &_CYHAL_ADCMIC_DEFAULT_CONFIG;
    config.clock = clk;
    config.num_channels = 0u;

